app/controllers/blerts_controller.rb

SELECT "blerts".* FROM "blerts"
---
  def index
    @blerts = Blert.all

SELECT "blerts".* FROM "blerts" WHERE "blerts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @blert = Blert.find(params[:id])

INSERT INTO "blerts" ("alerttype", "contact", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["alerttype", "fdsafsafda"], ["contact", "fdsafdsa"], ["created_at", Wed, 07 Nov 2012 23:02:12 UTC +00:00], ["updated_at", Wed, 07 Nov 2012 23:02:12 UTC +00:00], ["user_id", nil]]
---
  def create
    @blert = current_user.blerts.build(params[:blert])

    respond_to do |format|
      if @blert.save

SELECT "blerts".* FROM "blerts" WHERE "blerts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "blerts" WHERE "blerts"."id" = ?  [["id", 3]]
---
  def destroy
    @blert = Blert.find(params[:id])
    @blert.destroy