app/controllers/shows_controller.rb

def past
  @past_items = current_user.shows
  @pas_items = Show.where('date > ?', Date.today).order("date DESC").paginate(page: params[:page])
---
SELECT "shows".* FROM "shows" WHERE (date > '2012-11-07') ORDER BY date DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "shows" WHERE (date > '2012-11-06')

def future
  @januarys = Array.new
  @februarys = Array.new
  @marchs = Array.new
  @aprils = Array.new
  @mays = Array.new
  @junes = Array.new
  @julys = Array.new
  @augusts = Array.new
  @septembers = Array.new
  @octobers = Array.new
  @novembers = Array.new
  @decembers = Array.new
  @futures = Show.where('date >= ?', Date.today).sort! { |a,b| a.date <=> b.date }
---
SELECT "shows".* FROM "shows" WHERE (date >= '2012-11-05')

def edit
  @show = Show.find(params[:id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "2-ryan"]]

  def create
    @show = current_user.shows.build(params[:show])
    if @show.save
---
INSERT INTO "shows" ("acts", "altlink", "billdate", "cardnumber", "cardtype", "content", "created_at", "date", "details", "fblink", "flyerlink", "location", "owed", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @show.destroy
---
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 3]]