app/controllers/static_pages_controller.rb

SELECT "shows".* FROM "shows" WHERE (user_id == 1)
SELECT "shows".* FROM "shows" WHERE "shows"."user_id" = 1
SELECT "shows".* FROM "shows" WHERE (date < '2012-11-05') LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "shows" WHERE (date < '2012-11-05')
---
 def home
    if signed_in?
      @show  = current_user.shows.build
      @feed_items = Show.where('date >= ?', Date.today)
      @past_items = Show.where('user_id == ?', current_user.id)
      @feed_itemsz = current_user.feed.paginate(page: params[:page])