app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "shows".* FROM "shows" WHERE "shows"."user_id" = 1 LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "shows" WHERE "shows"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @shows = @user.shows.paginate(page: params[:page])

UPDATE "users" SET "name" = 'Ryan Williams', "password_digest" = '$2a$10$rGaivL/yrgquPNCLPJVH1uYN.3YZwZ5ppjqZGEYbJ3zE4umzTqBju', "remember_token" = 'yPiaVnWsXYJmuLTTgdmT7w', "updated_at" = '2012-11-06 19:38:41.524192' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])